# data_2021 = """
# નીતા		સરખડી 		ગોપી 		વશીલા  		કિર્તી		જાહલ		પાર્વતી		પાયલ		જમના		ગંગોત્રી		નિર્મલા		ધાવા		ગોદાવરી		કપિલા		ગોમતી		ધારા		યાત્રી		કાલીંદી		યમુના	
# સરખડી 		ગોપી 		વશીલા		પાયલ		જમના		ગંગોત્રી		નિર્મલા		ધાવા		ગોદાવરી		કપિલા		ગોમતી		ધારા		યાત્રી		કાલીંદી		યમુના		લીલડી		નંદની		સોનલ		વેણુ	
# પાયલ		જમના		ગંગોત્રી		નિર્મલા 		ધાવા		ગોદાવરી		કપિલા		ગોમતી		ધારા		યાત્રી		કાલીંદી		યમુના		લીલડી		નંદની		સોનલ		વેણુ		કિંજલ 		સોનુ		નર્મદા
# પાયલ		જમના		ગંગોત્રી		નિર્મલા 		ધાવા		ગોદાવરી		કપિલા		ગોમતી		ધારા		યાત્રી		કાલીંદી		યમુના		લીલડી		નંદની		સોનલ		વેણુ		કિંજલ 		સોનુ		નર્મદા		સોનારીયા 		શીતલ 		રૂપેણ		કોયલ		નીતા		વીજલી	
# પાયલ		ગંગોત્રી		નિર્મલા 		ધાવા		ગોદાવરી		કપિલા		ગોમતી		ધારા		યાત્રી		કાલીંદી		યમુના		લીલડી		નંદની		સોનલ		વેણુ		કિંજલ 		સોનુ		નર્મદા		સોનારીયા 		શીતલ 		રૂપેણ		કોયલ		નીતા		વીજલી		રાધિકા		વાલી		જાહલ		ગાયત્રી	
# પાયલ		ધાવા		ગોદાવરી		કપિલા		ગોમતી		ધારા		યાત્રી		કાલીંદી		યમુના		લીલડી		નંદની		સોનલ		વેણુ		કિંજલ 		સોનુ		નર્મદા		સોનારીયા 		શીતલ 		રૂપેણ		કોયલ		નીતા		વીજલી		રાધિકા		વાલી		જાહલ		ગાયત્રી		કીર્તી		સરખડી	
# ધાવા		ગોદાવરી		ધારા		યાત્રી		કાલીંદી		યમુના		લીલડી		નંદની		સોનલ		વેણુ		કિંજલ 		સોનુ		નર્મદા		સોનારીયા 		શીતલ 		રૂપેણ		કોયલ		નીતા		વીજલી		રાધિકા		વાલી		જાહલ		ગાયત્રી		કીર્તી		સરખડી		વશીલા		પુજા	
# ગોદાવરી		ધારા		યાત્રી		કાલીંદી		યમુના		લીલડી		નંદની		સોનલ		વેણુ		કિંજલ 		સોનુ		નર્મદા		સોનારીયા 		શીતલ 		રૂપેણ		કોયલ		નીતા		વીજલી		રાધિકા		વાલી		જાહલ		ગાયત્રી		કીર્તી		સરખડી		વશીલા		પુજા		ગંગોત્રી		પાયલ	
# ગોદાવરી		ધારા		યાત્રી		કાલીંદી		લીલડી		નંદની		સોનલ		વેણુ		કિંજલ 		સોનુ		નર્મદા		સોનારીયા 		શીતલ 		રૂપેણ		કોયલ		નીતા		વીજલી		રાધિકા		વાલી		જાહલ		ગાયત્રી		કીર્તી		સરખડી		વશીલા		પુજા		ગંગોત્રી		પાયલ		નિર્મલા 	
# ગોદાવરી		ધારા		યાત્રી		લીલડી		નંદની		સોનલ		વેણુ		કિંજલ 		સોનુ		નર્મદા		સોનારીયા 		શીતલ 		રૂપેણ		કોયલ		નીતા		વીજલી		રાધિકા		વાલી		જાહલ		ગાયત્રી		કીર્તી		સરખડી		વશીલા		પુજા		ગંગોત્રી		પાયલ		નિર્મલા		કમલી		ગૌરી		સમતા	
# ધારા		લીલડી		નંદની		વેણુ		કિંજલ		સોનુ		નર્મદા		સોનારીયા 		શીતલ 		રૂપેણ		કોયલ		નીતા		વીજલી		રાધિકા		વાલી		જાહલ		ગાયત્રી		કીર્તી		સરખડી		વશીલા		પુજા		ગંગોત્રી		પાયલ		નિર્મલા		કમલી		નંદબાલા 		ગોમતી 		કાલિંદી 		ધનલક્ષ્મી 		ગોદાવરી 	
# ધારા		લીલડી		વેણુ		 કિંજલ		 નર્મદા		સોનારીયા		 શીતલ 		 રૂપેણ  		 કોયલ		વીજલી		 રાધિકા 		વાલી		જાહલ		ગાયત્રી 		 કીર્તી		 સરખડી		વશીલા		 પુજા 		 ગંગોત્રી		પાયલ		નિર્મલા		 કમલી		નંદબાલા		ગોમતી		 કાલીંદી		 ધનલક્ષ્મી		 ગોદાવરી		 ધાવા		 કપીલા	
# """

# data_2022 = """
# નર્મદા		સોનારીયા		 શીતલ 		 કોયલ		વીજલી		 રાધિકા 		વાલી		જાહલ		ગાયત્રી 		 કીર્તી		 સરખડી		વશીલા		 પુજા 		 ગંગોત્રી		પાયલ		નિર્મલા		 કમલી		નંદબાલા		ગોમતી		 કાલીંદી		 ધનલક્ષ્મી		 ગોદાવરી		 ધાવા		 કપીલા		યમુના 		 જમના 		 લીલડી		યાત્રી 		રેવતી		નંદની	
# નર્મદા		સોનારીયા		 શીતલ 		 કોયલ		વીજલી		વાલી		જાહલ		ગાયત્રી 		 કીર્તી		 સરખડી		વશીલા		 પુજા 		 ગંગોત્રી		પાયલ		નિર્મલા		 કમલી		નંદબાલા		ગોમતી		 કાલીંદી		 ધનલક્ષ્મી		 ગોદાવરી		 ધાવા		 કપીલા		યમુના 		 જમના 		 લીલડી		યાત્રી 		રેવતી		નંદની		લીલા 		સોનલ		 રૂપેણ		સોનુ 	
# નર્મદા		 શીતલ 		 કોયલ		વીજલી		જાહલ		ગાયત્રી 		 કીર્તી		 સરખડી		વશીલા		 પુજા 		 ગંગોત્રી		પાયલ		નિર્મલા		 કમલી		નંદબાલા		ગોમતી		 કાલીંદી		 ધનલક્ષ્મી		 ગોદાવરી		 ધાવા		 કપીલા		યમુના 		 જમના 		 લીલડી		યાત્રી 		રેવતી		નંદની		લીલા 		સોનલ		 રૂપેણ		સોનુ 		લતા		નીતા 		નાગમતી	
# નર્મદા		 કોયલ		વીજલી		જાહલ		ગાયત્રી 		 કીર્તી		વશીલા		 પુજા 		 ગંગોત્રી		પાયલ		 કમલી		નંદબાલા		ગોમતી		 કાલીંદી		 ધનલક્ષ્મી		 ગોદાવરી		 ધાવા		 કપીલા		યમુના 		 લીલડી		યાત્રી 		રેવતી		નંદની		લીલા 		સોનલ		 રૂપેણ		સોનુ 		લતા		નીતા		નાગમતી	
# નર્મદા		 કોયલ		ગાયત્રી 		 કીર્તી		વશીલા		 પુજા 		 ગંગોત્રી		પાયલ		 કમલી		નંદબાલા		ગોમતી		 કાલીંદી		 ધનલક્ષ્મી		 ગોદાવરી		યમુના 		 લીલડી		યાત્રી 		રેવતી		નંદની		લીલા 		સોનલ		 રૂપેણ		સોનુ 		લતા		નીતા		નાગમતી		ધારા		વેણુ	
# કોયલ		ગાયત્રી 		 કીર્તી		વશીલા		 પુજા 		 ગંગોત્રી		પાયલ		નંદબાલા		ગોમતી		 ધનલક્ષ્મી		 ગોદાવરી		યમુના 		 લીલડી		યાત્રી 		રેવતી		નંદની		લીલા 		સોનલ		સોનુ 		લતા		નીતા		નાગમતી		ધારા		વેણુ		રાધિકા		યામિની 		વાલી		સતી	
# ગાયત્રી 		 કીર્તી		વશીલા		 ગંગોત્રી		નંદબાલા		ગોમતી		 ધનલક્ષ્મી		 ગોદાવરી		યમુના 		 લીલડી		યાત્રી 		રેવતી		નંદની		લીલા 		સોનલ		સોનુ 		લતા		નીતા		નાગમતી		ધારા		વેણુ		રાધિકા		યામિની 		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		નિર્મલા	
# નંદબાલા		ગોમતી		ગોદાવરી 		યમુના		 લીલડી		યાત્રી		જાહલ		નંદની		લીલા		સોનલ		સોનુ		લતા		નીતા		નાગમતી		ધારા		વેણુ		રાધિકા		યામિની		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		નિર્મલા		ગાયત્રી		પુજા	
# નંદબાલા		ગોદાવરી 		યમુના		 લીલડી		યાત્રી		રેવતી		નંદની		લીલા		સોનલ		સોનુ		લતા		નીતા		નાગમતી		ધારા		વેણુ		રાધિકા		યામીની		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		નિર્મલા		ગાયત્રી		પુજા		ગંગોત્રી		પાયલ		ગુંજન	
# નંદબાલા		યમુના		 લીલડી		નંદની		સોનલ		સોનુ		લતા		નીતા		નાગમતી		ધારા		વેણુ		રાધિકા		યામીની		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		નિર્મલા		ગાયત્રી		પુજા		ગંગોત્રી		પાયલ		ગુંજન		કોયલ		કાલીંદી		કમલી		રાજલ	
# નંદબાલા		યમુના		નંદની		સોનલ		સોનુ		લતા		નીતા		નાગમતી		ધારા		વેણુ		રાધિકા		યામીની		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		નિર્મલા		ગાયત્રી		પુજા		ગંગોત્રી		પાયલ		ગુંજન		કોયલ		કાલીંદી		કમલી		રાજલ		કિંજલ		પુષ્પા		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ	
# નંદબાલા		નંદની		સોનલ		સોનુ		લતા		નીતા		ધારા		વેણુ		રાધિકા		યામીની		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		નિર્મલા		ગાયત્રી		પુજા		ગંગોત્રી		પાયલ		ગુંજન		કોયલ		કાલીંદી		કમલી		રાજલ		કિંજલ		પુષ્પા		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		જમના		કોમલ		લીલા		ગોમતી		અલકનંદા		ધનલક્ષ્મી		ધાવા		રેવતી	
# """


# data_2023 = """
# નંદની		સોનલ		સોનુ		લતા		નીતા		ધારા		વેણુ		રાધિકા		યામીની		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		ગાયત્રી		પુજા		ગંગોત્રી		પાયલ		ગુંજન		કોયલ		કાલીંદી		કમલી		રાજલ		કિંજલ		પુષ્પા		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		જમના		કોમલ		લીલા		ગોમતી		અલકનંદા		ધનલક્ષ્મી		ધાવા		રેવતી		નંદબાલા		સુભદ્રા	
# નંદની		સોનુ		નીતા		ધારા		વેણુ		યામીની		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		ગાયત્રી		પુજા		ગંગોત્રી		પાયલ		ગુંજન		કોયલ		કાલીંદી		કમલી		રાજલ		કિંજલ		પુષ્પા		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		કોમલ		લીલા		ગોમતી		અલકનંદા		ધનલક્ષ્મી		ધાવા		રેવતી		નંદબાલા		સુભદ્રા		વીજળી		યાત્રી		ગાથા	
# નંદની		સોનુ		યામીની		વાલી		સતી		સોનારીયા		જાહલ		શીતલ		ગાયત્રી		પુજા		ગંગોત્રી		પાયલ		ગુંજન		કોયલ		કાલીંદી		કમલી		રાજલ		કિંજલ		પુષ્પા		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		કોમલ		લીલા		ગોમતી		અલકનંદા		ધનલક્ષ્મી		ધાવા		રેવતી		નંદબાલા		સુભદ્રા		વીજળી		યાત્રી		ગાથા		યશોદા		લતા		લીલડી		કિર્તી	
# સોનુ		વાલી		જાહલ		પુજા		પાયલ		ગુંજન		કોયલ		કાલીંદી		કમલી		રાજલ		કિંજલ		પુષ્પા		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		કોમલ		લીલા		ગોમતી		અલકનંદા		ધનલક્ષ્મી		ધાવા		રેવતી		નંદબાલા		સુભદ્રા		વીજળી		યાત્રી		ગાથા		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		રેશમા		નિરાલી	
# સોનુ		વાલી		જાહલ		પુજા		પાયલ		ગુંજન		કોયલ		કાલીંદી		કમલી		રાજલ		કિંજલ		પુષ્પા		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		કોમલ		લીલા		ગોમતી		અલકનંદા 		ધનલક્ષ્મી		ધાવા		રેવતી		નંદબાલા		સુભદ્રા		વીજળી		યાત્રી		ગાથા		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		રેશમા		નિરાલી		ધારા	
# ગુંજન		કોયલ		કાલીંદી		રાજલ		પુષ્પા		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		કોમલ		લીલા		ગોમતી		અલકનંદા		ધનલક્ષ્મી		ધાવા		રેવતી		નંદબાલા		સુભદ્રા		વીજળી		યાત્રી		ગાથા		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		રેશમા		નિરાલી		ધારા		વીના	
# ગુંજન		કોયલ		રાજલ		લીલાવતી		જાનકી		ધાત્રી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		કોમલ		લીલા		ગોમતી		અલકનંદા		ધનલક્ષ્મી		ધાવા		રેવતી		નંદબાલા		સુભદ્રા		વીજળી		યાત્રી		ગાથા		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		રેશમા		નિરાલી		ધારા		વીના		કપીલા		સુમિત્રા		વેણુ		અમી		સતી		સોનારીયા	
# ગુંજન		કોયલ		લીલાવતી		જાનકી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		સોનમ		નયના		કોમલ		લીલા		ગોમતી		અલકનંદા		ધનલક્ષ્મી		ધાવા		રેવતી		નંદબાલા		સુભદ્રા		વીજળી		યાત્રી		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		રેશમા		નિરાલી		ધારા		વીના		કપીલા		સુમિત્રા		વેણુ		અમી		સતી		સોનારીયા		રૂપેણ		યામીની		શીતલ		પુજા		કસ્તુરી		કાલીંદી	
# ગુંજન		જાનકી		અરિતી		શર્મિલા		ગોદાવરી		ગીતાંજલી		કોમલ		લીલા		ગોમતી		અલકનંદા		ધાવા		નંદબાલા		સુભદ્રા		વીજળી		યાત્રી		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		નિરાલી		ધારા		વીના		કપીલા		વેણુ		અમી		સતી		સોનારીયા		રૂપેણ		યામીની		શીતલ		પુજા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા	
# ગુંજન		જાનકી		અરિતી		શર્મિલા		ગીતાંજલી		લીલા		અલકનંદા		ધાવા		નંદબાલા		વીજળી		યાત્રી		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		નિરાલી		ધારા		વીના		કપીલા		વેણુ		અમી		સતી		સોનારીયા		રૂપેણ		યામીની		શીતલ		પુજા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા		કિંજલ		નીતા		રૂપાલી		ગાયત્રી		જાહલ		ગંગોત્રી	
# ગુંજન		અરિતી		શર્મિલા		ગીતાંજલી		લીલા		અલકનંદા		નંદબાલા		વીજળી		યાત્રી		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		નિરાલી		ધારા		વીના		કપીલા		વેણુ		સતી		સોનારીયા		રૂપેણ		યામીની		શીતલ		પુજા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા		કિંજલ		નીતા		રૂપાલી		ગાયત્રી		જાહલ		ગંગોત્રી		રેવતી		નિર્મલા		કવિતા		કમલી		નયના		વાલી		લીલાવતી	
# શર્મિલા		ગીતાંજલી		અલકનંદા		વીજળી		યશોદા		લતા		લીલડી		કિર્તી		કાવેરી		નિરાલી		ધારા		વીના		કપીલા		વેણુ		સતી		સોનારીયા		રૂપેણ		યામીની		શીતલ		પુજા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા		કિંજલ		નીતા		રૂપાલી		ગાયત્રી		જાહલ		ગંગોત્રી		રેવતી		નિર્મલા		કવિતા		કમલી		નયના		વાલી		લીલાવતી		ગોમતી		ગીતા		રાજલ		સંધ્યા		ગઝલ		સોનુ		ગુંજન		લીલા	
# """



# data_2024 = """
# ગીતાંજલી		અલકનંદા		યશોદા		લીલડી		કિર્તી		કાવેરી		નિરાલી		ધારા		વીના		કપીલા		વેણુ		સતી		સોનારીયા		રૂપેણ		યામીની		શીતલ		પુજા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા		કિંજલ		નીતા		ગાયત્રી		જાહલ		ગંગોત્રી		રેવતી		નિર્મલા		કવિતા		કમલી		નયના		વાલી		લીલાવતી		ગોમતી		ગીતા		રાજલ		સંધ્યા		ગઝલ		સોનુ		ગુંજન		લીલા		પુષ્પા		ધનલક્ષ્મી		સુરેખા		ગોદાવરી		ક્ષમતા		લલીતા	
# લીલડી		કિર્તી		કાવેરી		નિરાલી		ધારા		વીના		કપીલા		વેણુ		સતી		સોનારીયા		રૂપેણ		યામીની		શીતલ		પુજા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા		કિંજલ		નીતા		ગાયત્રી		જાહલ		ગંગોત્રી		રેવતી		નિર્મલા		કવિતા		કમલી		નયના		વાલી		લીલાવતી		ગોમતી		ગીતા		રાજલ		સંધ્યા		ગઝલ		સોનુ		ગુંજન		લીલા		પુષ્પા		ધનલક્ષ્મી		સુરેખા		ગોદાવરી		ક્ષમતા		લલીતા		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ	
# લીલડી		કિર્તી		કાવેરી		નિરાલી		ધારા		વીના		વેણુ		સતી		સોનારીયા		રૂપેણ		યામીની		શીતલ		પુજા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા		કિંજલ		નીતા		ગાયત્રી		ગંગોત્રી		રેવતી		નિર્મલા		કવિતા		કમલી		નયના		વાલી		લીલાવતી		ગોમતી		ગીતા		રાજલ		સંધ્યા		સોનુ		ગુંજન		લીલા		પુષ્પા		ધનલક્ષ્મી		સુરેખા		ગોદાવરી		ક્ષમતા		લલીતા		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા	
# લીલડી		કિર્તી		નિરાલી		ધારા		વીના		વેણુ		સોનારીયા		રૂપેણ		યામીની		પુજા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા		કિંજલ		નીતા		ગાયત્રી		ગંગોત્રી		રેવતી		નિર્મલા		કવિતા		કમલી		નયના		વાલી		લીલાવતી		ગોમતી		ગીતા		રાજલ		સંધ્યા		સોનુ		ગુંજન		લીલા		પુષ્પા		ધનલક્ષ્મી		સુરેખા		ગોદાવરી		લલીતા		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા		લતા		યશોદા		રેશમા		અરિતી	
# કિર્તી		નિરાલી		ધારા		સોનારીયા		કસ્તુરી		કાલીંદી		યમુના		રાધિકા		કિંજલ		નીતા		ગાયત્રી		ગંગોત્રી		રેવતી		નિર્મલા		કવિતા		કમલી		નયના		વાલી		લીલાવતી		ગોમતી		ગીતા		રાજલ		સંધ્યા		સોનુ		ગુંજન		લીલા		પુષ્પા		ધનલક્ષ્મી		સુરેખા		ગોદાવરી		લલીતા		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા		લતા		યશોદા		રેશમા		અરિતી		ધાત્રી	
# કિર્તી		ધારા		કસ્તુરી		કાલીંદી		રાધિકા		કિંજલ		નીતા		ગાયત્રી		ગંગોત્રી		નિર્મલા		કવિતા		કમલી		નયના		વાલી		લીલાવતી		ગીતા		રાજલ		સંધ્યા		સોનુ		ગુંજન		લીલા		પુષ્પા		ધનલક્ષ્મી		સુરેખા		ગોદાવરી		લલીતા		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા		લતા		યશોદા		રેશમા		અરિતી		ધાત્રી		ગીતાંજલી		નંદબાલા		વીજળી		લીલડી	
# ધારા		નીતા		ગંગોત્રી		નિર્મલા		કવિતા		નયના		વાલી		ગીતા		સંધ્યા		સોનુ		ગુંજન		લીલા		પુષ્પા		ધનલક્ષ્મી		સુરેખા		ગોદાવરી		લલીતા		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા		લતા		યશોદા		રેશમા		અરિતી		ધાત્રી		ગીતાંજલી		નંદબાલા		વીજળી		લીલડી		પુજા		વેણુ		સતી		શિતલ		સોનારીયા		કાવેરી		યામિની	
# ધારા		નીતા		ગંગોત્રી		કવિતા		વાલી		ગીતા		સંધ્યા		સોનુ		ગુંજન		લીલા		પુષ્પા		સુરેખા		ગોદાવરી		લલીતા		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા		લતા		યશોદા		રેશમા		અરિતી		ધાત્રી		ગીતાંજલી		નંદબાલા		વીજળી		લીલડી		પુજા		વેણુ		સતી		શિતલ		સોનારીયા		કાવેરી		યામિની	
# નીતા		કવિતા		વાલી		ગીતા		સંધ્યા		ગુંજન		સુરેખા		ગોદાવરી		લલીતા		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા		લતા		યશોદા		રેશમા		અરિતી		ધાત્રી		ગીતાંજલી		નંદબાલા		લીલડી		પુજા		વેણુ		સતી		શિતલ		સોનારીયા		કાવેરી		યામિની		રાધિકા		પાયલ		નિરાલી	
# નીતા		ગીતા		ગુંજન		સુરેખા		ગોદાવરી		વેજલ		કોમલ		કોયલ		વિજયા		સોનમ		સુભદ્રા		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા		લતા		યશોદા		રેશમા		અરિતી		ધાત્રી		ગીતાંજલી		નંદબાલા		લીલડી		પુજા		વેણુ		સતી		શિતલ		સોનારીયા		કાવેરી		યામિની		રાધિકા		પાયલ		નિરાલી		કિંજલ		વિના		કવિતા		યમુના		કિર્તી		ગેહના		નમ્રતા		રાજલ		કસ્તુરી		રૂપાલી	
# નીતા		ગીતા		ગુંજન		ગોદાવરી		વેજલ		વિજયા		સોનમ		સોનલ		યાત્રી		ગાથા		જાનકી		ધાવા		લતા		યશોદા		રેશમા		અરિતી		ધાત્રી		ગીતાંજલી		નંદબાલા		લીલડી		પુજા		વેણુ		સતી		શિતલ		સોનારીયા		કાવેરી		યામિની		રાધિકા		પાયલ		નિરાલી		કિંજલ		વિના		કવિતા		યમુના		કિર્તી		ગેહના		નમ્રતા		રાજલ		કસ્તુરી		રૂપાલી		ગંગોત્રી		રૂપેણ		રેવતી		નિર્મલા		કમલી		યોગિતા		ગ્રીવા		ગાયત્રી		વાલી		નયના		ધનલક્ષ્મી		ગોમતી	
# ગીતા		ગોદાવરી		વેજલ		સોનમ		સોનલ		યાત્રી 		ગાથા		ધાવા		લતા		રેશમા		અરિતી		ગીતાંજલી		નંદબાલા		લીલડી		પુજા		વેણુ		સતી		શિતલ		સોનારીયા		કાવેરી		યામિની		પાયલ		નિરાલી		વિના		કવિતા		યમુના		કિર્તી		ગેહના		નમ્રતા		રાજલ		કસ્તુરી		રૂપાલી		ગંગોત્રી		રૂપેણ		રેવતી		નિર્મલા		કમલી		યોગિતા		ગ્રીવા		ગાયત્રી		વાલી		નયના		ધનલક્ષ્મી		ગોમતી		નંદની		લીલા		ગઝલ		નિધિ		જાહલ		ધારા		કાલીંદી		સુરેખા	
# """


# data_2025 = """
# ગીતા		ગોદાવરી		સોનમ		"સોનલ	"		લતા		રેશ્મા		અરિતિ		ગીતાંજલી		નંદબાલા		લીલડી		પુજા		વેણુ		સતી		શીતલ		સોનારીયા		યામિની		પાયલ 		નિરાલી 		વિના 		કવિતા 		યમુના 		કીર્તિ 		ગેહના 		નમ્રતા 		રાજલ 		કસ્તુરી 		રૂપાલી		ગંગોત્રી 		રૂપેણ 		રેવતી		કમલી		યોગિતા		ગ્રીવા		ગાયત્રી		વાલી		નયના		ધનલક્ષમી		ગોમતી		નંદની		લીલા		ગઝલ		નિધી 		જાહલ 		ધારા 		કાલીંદી		સુરેખા 		કોયલ 		સોનુ 		કન્યા 		સંધ્યા 	
# ગોદાવરી 		સોનમ 		સોનલ 		લતા 		અરિતી 		ગીતાંજલી 		નંદબાલા		લીલડી 		પૂજા 		વેણુ 		સતી 		શિતલ 		સોનારીયા 		યામીની 		પાયલ 		નિરાલી 		વિના 		કવિતા 		યમુના 		કિર્તી 		ગેહના 		નમ્રતા 		રાજલ 		કસ્તુરી 		રૂપાલી 		ગંગોત્રી 		રૂપેણ 		રેવતી 		કમલી 		યોગિતા 		ગ્રીવા 		ગાયત્રી 		વાલી 		નયના 		ધનલક્ષ્મી 		નંદની 		લીલા 		ગઝલ 		નીધી 		જાહલ 		ધારા 		કાલીંદી		સુરેખા 		કોયલ 		સોનુ 		કન્યા 		સંધ્યા 		ક્ષમતા 		ગુંજન 		યાત્રી 		કલ્યાણી 	
# ગોદાવરી 		સોનલ		લતા 		અરિતી 		ગીતાંજલી 		નંદબાલા 		લીલડી 		વેણુ 		સતી 		શિતલ 		સોનારીયા 		યામિની 		પાયલ 		નિરાલી 		વિના 		કવિતા 		યમુના 		કિર્તી 		ગેહના 		નમ્રતા 		રાજલ 		કસ્તુરી 		રુપાલી 		ગંગોત્રી 		રૂપેણ 		રેવતી 		કમલી 		યોગીતા 		ગ્રીવા 		ગાયત્રી 		વાલી 		નયના 		ધનલક્ષ્મી 		નંદની 		લીલા 		ગઝલ 		નીધી 		ધારા 		કાલિંદી 		સુરેખા 		કોયલ 		સોનુ 		કન્યા 		સંધ્યા 		ગુંજન 		યાત્રી 		કલ્યાણી 		સુભદ્રા 		જાનકી 		ધાત્રી 	
# ગોદાવરી 		સોનલ 		લતા 		અરિતી 		ગીતાંજલી 		નંદબાલા 		લીલડી 		વેણુ 		સતી 		સોનારીયા 		પાયલ 		નિરાલી 		વિના 		કવિતા 		યમુના 		કિર્તી 		ગેહના 		નમ્રતા 		રાજલ 		કસ્તુરી 		રુપાલી 		ગંગોત્રી 		રૂપેણ 		રેવતી 		કમલી 		યોગીતા 		ગ્રીવા 		ગાયત્રી 		વાલી 		નયના 		ધનલક્ષ્મી 		નંદની 		લીલા 		ગઝલ 		નીધી 		ધારા 		કાલીંદી		સુરેખા 		કોયલ 		સોનુ 		કન્યા 		સંધ્યા 		ગુંજન 		યાત્રી 		કલ્યાણી 		સુભદ્રા 		જાનકી 		ધાત્રી 	
# ગોદાવરી 		સોનલ 		લતા 		અરિતી 		ગીતાંજલી 		નંદબાલા 		લીલડી 		વેણુ 		પાયલ 		નિરાલી 		વિના 		કવિતા 		યમુના 		કિર્તી 		ગેહના 		નમ્રતા 		રાજલ 		કસ્તુરી 		રુપાલી 		ગંગોત્રી 		રૂપેણ 		રેવતી 		કમલી 		યોગિતા		ગ્રીવા 		ગાયત્રી 		વાલી 		નયના 		ધનલક્ષ્મી 		નંદની 		લીલા 		ગઝલ 		નીધી 		ધારા 		સુરેખા 		કોયલ 		સોનુ 		કન્યા 		સંધ્યા 		ગુંજન 		યાત્રી 		કલ્યાણી 		સુભદ્રા 		જાનકી 		ધાત્રી 	
# ગોદાવરી 		સોનલ 		લતા 		અરિતી 		ગીતાંજલી 		નંદબાલા 		લીલડી 		પાયલ 		નિરાલી 		વિના 		કવિતા 		કિર્તી 		ગેહના 		નમ્રતા 		કસ્તુરી 		રુપાલી 		ગંગોત્રી 		રૂપેણ 		રેવતી 		કમલી 		યોગીતા 		ગ્રીવા 		ગાયત્રી 		વાલી 		નયના 		ધનલક્ષ્મી 		નંદની 		લીલા 		ગઝલ 		નીધી 		ધારા 		સુરેખા 		કોયલ 		સોનુ 		કન્યા 		સંધ્યા 		ગુંજન 		યાત્રી 		કલ્યાણી 		સુભદ્રા 		જાનકી 		ધાત્રી 	
# """

# # result = sorted(set(data_2025.split()))
# # print(result)


# db_data = """
# SOM-049
# SOM-101
# SOM-170
# SOM-057
# SOM-159
# SOM-113
# SOM-025
# SOM-143
# SOM-045
# SOM-039
# SOM-180
# SOM-166
# SOM-080
# SOM-032
# SOM-059
# SOM-002
# SOM-009
# SOM-088
# SOM-094
# SOM-033
# SOM-122
# SOM-131
# SOM-192
# SOM-223
# SOM-140
# SOM-182
# SOM-206
# SOM-145
# SOM-188
# SOM-195
# SOM-086
# """


# excel_data = """
# SOM-122
# SOM-170
# SOM-033
# SOM-140
# SOM-113
# SOM-057
# SOM-188
# SOM-101
# SOM-049
# SOM-059
# SOM-088
# SOM-131
# SOM-032
# SOM-094
# SOM-086
# SOM-166
# SOM-045
# SOM-145
# SOM-009
# SOM-039
# SOM-002
# SOM-142
# SOM-143
# """


# # result = sorted(set(excel_data.split()))
# # print(result)


# db_result = ['SOM-002', 'SOM-009', 'SOM-025', 'SOM-032', 'SOM-033', 'SOM-039', 'SOM-045', 'SOM-049', 'SOM-057', 'SOM-059', 'SOM-080', 'SOM-086', 'SOM-088', 'SOM-094', 'SOM-101', 'SOM-113', 'SOM-122', 'SOM-131', 'SOM-140', 'SOM-143', 'SOM-145', 'SOM-159', 'SOM-166', 'SOM-170', 'SOM-180', 'SOM-182', 'SOM-188', 'SOM-192', 'SOM-195', 'SOM-206', 'SOM-223']

# excel_result = ['SOM-002', 'SOM-009', 'SOM-032', 'SOM-033', 'SOM-039', 'SOM-045', 'SOM-049', 'SOM-057', 'SOM-059', 'SOM-086', 'SOM-088', 'SOM-094', 'SOM-101', 'SOM-113', 'SOM-122', 'SOM-131', 'SOM-140', 'SOM-142', 'SOM-143', 'SOM-145', 'SOM-166', 'SOM-170', 'SOM-188']


# intersection_result = []
# present_in_db = []

# for i in excel_result:
#     if i not in db_result:
#         intersection_result.append(i)

# print(intersection_result)
# print(len(intersection_result))










all_female_cattle = ['SOM-018', 'SOM-027', 'SOM-029', 'SOM-030', 'SOM-035', 'SOM-044', 'SOM-046', 'SOM-047', 'SOM-050', 'SOM-051', 'SOM-053', 'SOM-054', 'SOM-062', 'SOM-065', 'SOM-069', 'SOM-082', 'SOM-08652346', 'SOM-116', 'SOM-138', 'SOM-144', 'SOM-156', 'SOM-158', 'SOM-160', 'SOM-163', 'SOM-164', 'SOM-167', 'SOM-178', 'SOM-180', 'SOM-182', 'SOM-192', 'SOM-195', 'SOM-197', 'SOM-198', 'SOM-200', 'SOM-206', 'SOM-207', 'SOM-209', 'SOM-210', 'SOM-211', 'SOM-215', 'SOM-216', 'SOM-219', 'SOM-222', 'SOM-223', 'SOM-226', 'SOM-228', 'SOM-229', 'SOM-231', 'SOM-232', 'SOM-233', 'SOM-234', 'SOM-237', 'SOM-239', 'SOM-240', 'SOM-241', 'SOM-247', 'SOM-249', 'SOM-252', 'SOM-255', 'SOM-257', 'SOM-261', 'SOM-263', 'SOM-267', 'SOM-270', 'SOM-271', 'SOM-272', 'SOM-274', 'SOM-275', 'SOM-276', 'SOM-277', 'SOM-279', 'SOM-281', 'SOM-283', 'SOM-284', 'SOM-285', 'SOM-287', 'SOM-289', 'SOM-290', 'SOM-292', 'SOM-296', 'SOM-297', 'SOM-300', 'SOM-301', 'SOM-303', 'SOM-304', 'SOM-305', 'SOM-307', 'SOM-308', 'SOM-310', 'SOM-311', 'SOM-314', 'SOM-315', 'SOM-316', 'SOM-317', 'SOM-319', 'SOM-322', 'SOM-329', 'SOM-332', 'SOM-339', 'SOM-344', 'SOM-345', 'SOM-346', 'SOM-348', 'SOM-351', 'SOM-356', 'SOM-357', 'SOM-358', 'SOM-361', 'SOM-364', 'SOM-365', 'SOM-366', 'SOM-367', 'SOM-368', 'SOM-369', 'SOM-371', 'SOM-373', 'SOM-375', 'SOM-376', 'SOM-377', 'SOM-382', 'SOM-384', 'SOM-385', 'SOM-388', 'SOM-393', 'SOM-394', 'SOM-395', 'SOM-396', 'SOM-399', 'SOM-402', 'SOM-404', 'SOM-407', 'SOM-408', 'SOM-409', 'SOM-412', 'SOM-90e01f73']


included_cattle = ['SOM-018', 'SOM-023', 'SOM-027', 'SOM-029', 'SOM-030', 'SOM-034', 'SOM-044', 'SOM-053', 'SOM-056', 'SOM-062', 'SOM-064', 'SOM-068', 'SOM-160', 'SOM-163', 'SOM-178', 'SOM-207', 'SOM-216', 'SOM-222', 'SOM-237', 'SOM-241', 'SOM-247', 'SOM-263', 'SOM-272', 'SOM-274', 'SOM-283', 'SOM-285', 'SOM-301', 'SOM-311', 'SOM-339', 'SOM-351', 'SOM-357', 'SOM-358', 'SOM-365', 'SOM-376']

mcattle = []
missing_cattle = sorted(set(all_female_cattle) - set(included_cattle))
for cattle in missing_cattle:
    # print(cattle)
    mcattle.append(cattle)
print(mcattle)

# we_want = []

# for i in included_cattle:
#     if i not in all_female_cattle:
#         we_want.append(i)


# result = we_want
# print(result)


# included_cattle = """
# SOM-160
# SOM-263
# SOM-030
# SOM-178
# SOM-237
# SOM-358
# SOM-027
# SOM-064
# SOM-068
# SOM-056
# SOM-247
# SOM-311
# SOM-034
# SOM-044
# SOM-241
# SOM-301
# SOM-365
# SOM-029
# SOM-216
# SOM-053
# SOM-062
# SOM-018
# SOM-163
# SOM-207
# SOM-274
# SOM-376
# SOM-222
# SOM-339
# SOM-272
# SOM-283
# SOM-023
# SOM-357
# SOM-285
# SOM-351
# """

# result = sorted(set(included_cattle.split()))
# print(result)